Repository: 84000/data-translation-memory
Catalog: Toh_157-The_Questions_of_the_Kimnara_King_Druma-v2.tmx
Source language: bo
Languages: en

source: སྟོབས་བཅུ་དང་མི་འཇིགས་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ཀྱི་སྣོད་ཕྱིར་མི་ལྡོག་པའི་ས་སྟེ།
en: (33) the level of irreversibility—the vessel of the ten powers, the fearlessnesses, and the unique buddha qualities.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་སུམ་ཅུ་རྩ་གཉིས་པོ་འདི་དག་དང་ལྡན་ན་ཆོས་ཀྱི་སྣོད་དུ་རིག་པར་བྱའོ། །
en: Noble son, you should know that if bodhisattva great beings possess those thirty-two qualities they will be proper vessels for the Dharma.”

source: བསྟན་པ་འདི་བཤད་པ་ན་སྲོག་ཆགས་ཁྲིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ནས། ཚིག་འདི་སྐད་ཅེས་བཅོམ་ལྡན་འདས་སེམས་ཅན་ཐམས་ཅད་ཀྱང་འདི་འདྲ་བའི་ཆོས་ཀྱི་སྣོད་དུ་གྱུར་ཅིག །
en: When the Blessed One had expounded this teaching, ten thousand beings gave rise to the mind set on unsurpassed and perfect awakening and said, “Blessed One, may all beings become proper vessels for the Dharma, and

source: བདག་ཅག་ཀྱང་བཅོམ་ལྡན་འདས་ཀྱིས་ཇི་སྐད་དུ་བསྟན་པའི་ཆོས་དེ་ལྟ་བུའི་སྣོད་དུ་གྱུར་ཅིག་ཅེས་སྨྲས་སོ། །
en: may we also become such proper Dharma vessels as described by the Blessed One!”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་མི་འམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: The Blessed One then said to the kiṃnara king Druma,

source: མི་འམ་ཅིའི་བདག་པོ་ཁྱོད་ཀྱིས་འཁོར་འདི་སྐྱོ་བར་འགྱུར་དུ་འོང་གིས་ཁྱོད་རང་གི་གནས་སུ་སོང་ཤིག །
en: “Lord of the kiṃnaras, your retinue might start to become weary, so you should go back to your abode.”

source: མི་འམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོས་གསོལ་པ།
en: The kiṃnara king Druma replied,

source: བཅོམ་ལྡན་འདས་གང་ཡོངས་སུ་སྐྱོ་བ་དེ་བྱང་ཆུབ་སེམས་དཔའ་ཞེས་མི་བགྱི་སྟེ
en: “Blessed One, someone who becomes weary cannot be called a bodhisattva.

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔས་ནི་སྐྱོ་བ་བཟོད་པར་བགྱིའོ། །
en: Blessed One, bodhisattvas should withstand weariness.

source: བཅོམ་ལྡན་འདས་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་ཡོངས་སུ་སྐྱོ་བ་ལགས།
en: Blessed One, how are bodhisattvas to be known as wearying?

source: ཇི་ལྟར་ན་ཡོངས་སུ་མི་སྐྱོ་བ་ལགས།
en: How are they to be known as unwearying?”

source: མི་འམ་ཅིའི་བདག་པོ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་དང་ལྡན་ན་ཡོངས་སུ་སྐྱོ་བར་འགྱུར་རོ། །
en: “Lord of the kiṃnaras,” “if bodhisattvas adopt four attitudes, they are to be known as wearying.

source: སེམས་ཅན་གྱི་ཁམས་ཚད་མེད་པ་ཐོས་ན་སྐྲག་པ་དང་། འཁོར་བ་ཚད་མེད་པ་ཐོས་ན་སྐྲག་པ་དང་། སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་ཚད་མེད་པར་ཐོས་ན་སྐྲག་པ་དང་། བསོད་ནམས་ཚད་མེད་པས་མཚན་དང་དཔེ་བྱད་བཟང་པོ་འགྲུབ་པ་ཐོས་ན་སྐྲག་པ་སྟེ།
en: They are (1) being scared when hearing that the realm of beings is infinite, (2) being scared when hearing about limitless saṃsāra, (3) being scared when hearing about the immeasurable wisdom of the buddhas, and (4) being scared when hearing that the excellent major and minor marks are achieved through boundless merit.

source: མི་འམ་ཅིའི་བདག་པོ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་པོ་འདི་དག་དང་ལྡན་ན་ཡོངས་སུ་སྐྱོ་བར་རིག་པར་བྱའོ། །
en: Lord of the kiṃnaras, you should know that, if bodhisattvas adopt those four attitudes, they are to be known as wearying.

source: མི་འམ་ཅིའི་བདག་པོ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་དང་ལྡན་ན་ཡོངས་སུ་མི་སྐྱོ་བར་རིག་པར་བྱའོ། །
en: “Lord of the kiṃnaras, you should know that if bodhisattvas adopt four attitudes they are to be known as unwearying.

source: བཞི་གང་ཞེ་ན་
en: What are those four?

source: སེམས་ཅན་གྱི་ཁམས་ཚད་མེད་པ་དེ་ཡང་བདག་གི་ཡོངས་སུ་མྱ་ངན་ལས་བཟླ་བར་བྱའོ་ཞེས་ཐོས་ན་མི་སྐྲག་པ་དང་། དགེ་བའི་རྩ་བ་བསྒྲུབ་པའི་ཕྱིར་འཁོར་བ་ཚད་མེད་པ་ཡོངས་སུ་གཟུང་བར་བྱའོ་ཞེས་ཐོས་ན་མི་སྐྲག་པ་དང་། ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཚད་མེད་པ་དེ་བདག་གི་ཡོངས་སུ་རྫོགས་པར་བྱའོ་ཞེས་ཐོས་ན་མི་སྐྲག་པ་དང་། བསོད་ནམས་ཚད་མེད་པ་བསགས་པས་མཚན་དང་དཔེ་བྱད་བཟང་པོ་འགྲུབ་སྟེབདག་གིས་ཀྱང་བསྒྲུབ་པར་བྱའོ་ཞེས་ཐོས་ན་མི་སྐྲག་པ་སྟེ།
en: They are (1) not being scared when hearing the words, ‘I will cause the infinite realm of beings to pass beyond suffering,’ (2) not being scared when hearing the words, ‘I will embrace limitless saṃsāra to accomplish roots of virtue,’ (3) not being scared when hearing the words, ‘I will perfect immeasurable omniscient wisdom,’ and (4) not being scared when hearing the words, ‘I will achieve the excellent major and minor marks that are attained by accumulating boundless merit.’

source: མི་འམ་ཅིའི་བདག་པོ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་པོ་འདི་དག་དང་ལྡན་ན་ཡོངས་སུ་མི་སྐྱོ་བར་རིག་པར་བྱའོ། །
en: Lord of the kiṃnaras, you should know that if bodhisattvas adopt those four attitudes they are to be known as unwearying.

source: མི་འམ་ཅིའི་བདག་པོ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་དང་ལྡན་ན་ཡོངས་སུ་སྐྱོ་བར་རིག་པར་བྱའོ། །
en: “Furthermore, lord of the kiṃnaras, you should know that if bodhisattvas adopt four attitudes they are to be known as wearying.

source: སྐབས་སྐབས་སུ་ཉན་ཐོས་ཀྱི་ཐེག་པ་ལ་རེ་བ་དང་། སྐབས་སྐབས་སུ་རང་སངས་རྒྱས་ཐེག་པ་ལ་རེ་བ་དང་། དམ་པའི་ཆོས་རྣམ་པར་འཇིག་པ་ན་ཡལ་བར་འདོར་ཞིང་ཡོངས་སུ་མི་འཛིན་པ་དང་། གཞན་ཡང་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཡང་དག་པར་འཛིན་ཏུ་མི་འཇུག་པ་སྟེ།
en: They are (1) occasionally wishing for the vehicle of the hearers, (2) occasionally wishing for the vehicle of the solitary buddhas, (3) forsaking the Dharma and not upholding it when it is about to disappear, and (4) not causing others to embrace perfect awakening.

source: མི་འམ་ཅིའི་བདག་པོ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་དང་ལྡན་ན་ཡོངས་སུ་མི་སྐྱོ་བར་རིག་པར་བྱའོ། །
en: “Furthermore, lord of the kiṃnaras, you should know that if bodhisattvas adopt four attitudes they are to be known as unwearying.

source: !རབ་ཏུ་ཉེན་ཀྱང་བྱང་ཆུབ་ཀྱི་སེམས་མི་གཏོང་བ་དང་། ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱིས་ལ་མི་དབང་བ་དང་། ལུས་དང་སྲོག་འདོར་ཞིང་དམ་པའི་ཆོས་བསྲུང་བ་དང་། དཔག་ཚད་སྟོང་དུ་འགྲོ་ཞིང་གཞན་དག་བྱང་ཆུབ་ཡང་དག་པར་འཛིན་དུ་འཇུག་པ་སྟེ།
en: They are (1) never forsaking the mind set on awakening even if it puts them in grave danger, (2) never wishing for the level of the hearers and the solitary buddhas, (3) guarding the sacred Dharma even at the cost of their lives, and (4) willingly traveling a thousand leagues to cause others to embrace awakening.

source: སློང་བ་མཐོང་ན་ཡོངས་སུ་སྐྱོ་བ་དང་། བསོད་སྙོམས་བྱེད་པར་སྦྱོར་བ་ལ་བརྩོན་པར་གནས་པ་དང་། མང་དུ་ཐོས་པ་ཚོལ་བ་ལ་མི་བརྩོན་པ་དང་། ཇི་ལྟར་ཐོས་པའི་ཆོས་རྣམས་གཞན་ལ་མི་སྟོན་པ་སྟེ།
en: They are (1) being unhappy when meeting beggars, (2) putting all their efforts into collecting alms, (3) not putting effort into the pursuit of erudition, and (4) not teaching the Dharma to others as they have heard it.

source: སློང་བ་ལ་བཤེས་གཉེན་དུ་འདུ་ཤེས་སྐྱེད་ཅིང་ཞེ་སྡང་བའི་སེམས་མེད་ལ་བཞིན་འཛུམ་ཞིང་ཁྲོ་གཉེར་མེད་དེ་ཚུར་ཤོག་ལེགས་པར་འོངས་སམ་ཞེས་བྱ་བའི་ཚིག་སྨྲ་བ་དང་། བདག་བདེ་བ་ལ་མི་ཆགས་ཤིང་སེམས་ཅན་ཐམས་ཅད་ལ་བདེ་བ་རབ་ཏུ་སྦྱིན་པ་དང་། མང་དུ་ཐོས་པ་ཚོལ་བས་མི་ངོམས་ཤིང་། ཇི་ལྟར་ཐོས་པའི་ཆོས་རྣམས་ཀྱང་གཞན་དག་ལ་རྒྱ་ཆེར་རབ་ཏུ་སྟོན་ཅིང་ཟང་ཟིང་མེད་པའི་སེམས་ཀྱི་ཆོས་དེ་གཞན་ལ་རབ་ཏུ་སྟོན་པ་སྟེ།
en: They are (1) perceiving beggars as friends, smiling to them with a mind free from anger, and, without frowning, telling them, ‘Welcome, please come here,’ (2) granting happiness to all beings without being attached to their personal happiness, (3) tirelessly pursuing erudition, and (4) teaching the Dharma that they have heard to others, fully and with a mind unconcerned with material things.

source: སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ལམ་ཡོངས་སུ་མི་ཚོལ་བ་དང་། བསྡུ་བའི་དངོས་པོ་ལ་མི་སྦྱོར་བ་དང་། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པར་བརྩོན་འགྲུས་མི་རྩོམ་པ་དང་། ཡོན་ཏན་ཆུང་ངུ་ཙམ་གྱིས་ཆོག་པར་འཛིན་ཅིང་གོང་དུ་མི་ཚོལ་བ་སྟེ།
en: They are (1) not pursuing the path of the perfection of generosity, (2) not engaging in the means of attracting disciples, (3) not engendering diligence to ripen sentient beings, and (4) being satisfied with lesser qualities and not pursuing higher ones.

source: བཞི་གང་ཞེ་ན་འདི་ལྟ་སྟེ།
en: What are those four?

source: མགོའི་ཐོད་ལ་མེ་འབར་བ་བཞིན་དུ་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ལམ་ཡོངས་སུ་ཚོལ་བ་དང་། བསྡུ་བའི་དངོས་པོ་ལ་རྟག་ཏུ་བརྩོན་པ་དང་། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པར་བརྩོན་འགྲུས་རྩོམ་པ་དང་། དགེ་བ་ཐམས་ཅད་ཡོངས་སུ་བཀང་བའི་ཕྱིར་དེ་ལ་མི་ཆགས་པ་ཡིན་ཏེ
en: They are (1) pursuing the path of the perfection of generosity as if their hair was on fire, (2) always exerting themselves in the means of attracting disciples, (3) engendering diligence to ripen sentient beings, and (4) perfecting all forms of virtue without being attached to them.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཆོས་བཞི་བསྒྲུབ་པ་འདི་མི་འམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོ་ལ་ལན་བཏབ་ནས་རྒྱལ་པོ་མ་སྐྱེས་དགྲ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: After the Blessed One had answered the kiṃnara king Druma with this teaching on the fourfold attitudes, he asked King Ajātaśatru,

source: རྒྱལ་པོ་ཆེན་པོ་ཁྱོད་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཡོངས་སུ་སྐྱོ་བ་དང་། ཡོངས་སུ་མི་སྐྱོ་བ་བཞི་བསྒྲུབ་པ་ལ་འཇུག་པ་འདི་ཐོས་སམ།
en: “Your Majesty, did you hear this teaching of fourfold attitudes that cause the bodhisattvas to be known as wearying and unwearying?”

source: བཅོམ་ལྡན་འདས་ཐོས་ལགས་སོ། །
en: “Yes, Blessed One, I heard it.”

source: རྒྱལ་པོ་ཆེན་པོ་དེ་ལྟ་བས་ན་ཁྱོད་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་ཡོངས་སུ་མི་སྐྱོ་བར་སྤྱད་པར་བྱའོ། །
en: “Your Majesty, in that case you should practice bodhisattva conduct without becoming weary!”

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྤྱོད་པ་གང་ལགས།
en: “Blessed One, what is the conduct of the bodhisattvas?”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་རྒྱལ་པོ་མ་སྐྱེས་དགྲའི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཡོངས་སུ་བསྐང་བའི་ཕྱིར་མི་འམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོ་ལ་བཀའ་སྩལ་པ།
en: Then, in order to perfect the bodhisattva conduct of King Ajātaśatru, the Blessed One said to the kiṃnara king Druma,

source: མི་འམ་ཅིའི་བདག་པོ་ཇི་ལྟར་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པའི་རང་གི་ཐབས་མཁས་པའི་ཁྱད་པར་རྒྱལ་པོ་མ་སྐྱེས་དགྲ་འདིའི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཡོངས་སུ་བསྐང་བའི་ཕྱིར་ཁྱོད་ཀྱིས་སྟོན་ཅིག།
en: “Lord of the kiṃnaras, please explain your extraordinary skillful methods by which you ripen beings, in order to perfect the bodhisattva conduct of King Ajātaśatru!”

source: དེ་ནས་མི་འམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོས་རང་གི་པི་བང་དེ་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་བླངས་སོ། །
en: At that moment, the kiṃnara king Druma picked up his lute in front of the Blessed One.

source: པི་བང་དེ་བླངས་མ་ཐག་ཏུ་དེ་ནས་སངས་རྒྱས་ཀྱི་མཐུ་དང་། མི་འམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོའི་དགེ་བའི་རྩ་བའི་གཟི་བརྗིད་ཀྱིས་པི་བང་གི་སྒྲ་དེ་ལས་སེང་གེ་བསྒྱིངས་པ་ལྟར་ཤིང་སཱ་ལ་དུ་མ་གཡོ་བའི་སྒྲར་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའི་ཚིགས་སུ་བཅད་པ་འདི་དག་བྱུང་ངོ་། །
en: As soon as he picked it up, through the power of the Buddha and the magnificence of his own roots of virtue, these verses on bodhisattva conduct manifested from his lute in a tune that resembled the lion’s yawn, or the sound of the wind as it stirs a group of sāl trees:

source: ཕན་པ་སྤྱོད་པ་དག་དང་དོན་སྤྱོད་དང་། །ཆོས་ཐོས་ནན་ཏན་བྱེད་པ་སྤྱོད་པ་དང་། །བྱང་ཆུབ་མཆོག་གི་སྤྱོད་པ་གང་སྤྱོད་པ། །དེ་དག་ཡོངས་སུ་སྐྱོ་བ་མེད་པར་སྤྱོད། །
en: “Those who engage in help and benefit, Those who earnestly apply themselves to listening to the Dharma, And those who practice supreme awakening Practice without becoming weary.

source: བདེ་བ་སྤྱོད་དང་སྐྱིད་པ་སྤྱོད་པ་དང་། །སེམས་ཅན་ཀུན་ལ་སེམས་སྙོམས་སྤྱོད་པ་དང་། །བྱང་ཆུབ་མཆོག་གི་སྤྱོད་པ་གང་སྤྱོད་པ། །དེ་དག་རྒྱ་ཆེན་མ་ཡིན་སྤྱོད་པ་མེད། །
en: “Those who make others well and happy, Those who are unbiased toward all beings, And those who practice supreme awakening Do not practice a limited form of conduct.

source: བརྟན་པ་སྤྱོད་དང་བདེན་པ་སྤྱོད་པ་དང་། །བསམ་པ་ཡོངས་སུ་དག་པ་སྤྱོད་པ་དང་། །བྱང་ཆུབ་མཆོག་གི་སྤྱོད་པ་གང་སྤྱོད་པ། །དེ་དག་གང་དུའང་སྒྱུ་མེད་སྤྱོད་པ་ཡིན། །
en: “Those who practice stability and truth, Those who engage in the immaculate intent, And those who practice supreme awakening Practice without deception in all regards.

source: དུལ་བ་སྤྱོད་དང་སྦྱིན་པ་སྤྱོད་པ་དང་། །དངོས་པོ་ཐམས་ཅད་ཡོངས་སུ་གཏོང་སྤྱོད་དང་། །བྱང་ཆུབ་མཆོག་གི་སྤྱོད་པ་གང་སྤྱོད་པ། །དེ་དག་སེར་སྣ་མེད་པར་སྤྱོད་པ་ཡིན། །
en: “Those who practice self-control and generosity, Those who give away all their possessions, And those who practice supreme awakening Practice without miserliness.

source: ཚུལ་ཁྲིམས་སྤྱོད་པ་མ་ཉམས་སྤྱོད་པ་དང་། །ལུས་དང་ངག་ནི་ཡོངས་དག་སྤྱོད་པ་དང་། །བྱང་ཆུབ་མཆོག་གི་སྤྱོད་པ་གང་སྤྱོད་པ། །དེ་དག་ངན་པའི་ངང་ཚུལ་སྤྱོད་པ་མེད། །
en: “Those who practice discipline and uncorrupted conduct, Those who maintain pure body and speech, And those who practice supreme awakening Practice without bad behavior.

source: བརྟུལ་ཞུགས་སྤྱོད་དང་བཟོད་པ་སྤྱོད་པ་དང་། །ཁྲོ་སྐྱོན་ཡོངས་སུ་གཅོད་པའི་སྤྱོད་པ་དང་། །བྱང་ཆུབ་མཆོག་གི་སྤྱོད་པ་གང་སྤྱོད་པ། །དེ་དག་གནོད་སེམས་མེད་པར་སྤྱོད་པ་ཡིན། །
en: “Those who practice disciplined conduct and patience, Those who eliminate the defects of aggression, And those who practice supreme awakening Practice without ill will.

source: བརྩོན་འགྲུས་སྤྱོད་དང་མཐུ་རྣམས་སྤྱོད་པ་དང་། །འཁོར་བར་ཡོངས་སུ་མི་སྐྱོ་སྤྱོད་པ་དང་། །བྱང་ཆུབ་མཆོག་གི་སྤྱོད་པ་གང་སྤྱོད་པ། །དེ་དག་ལེ་ལོ་མེད་པར་སྤྱོད་པ་ཡིན། །
en: “Those who practice diligence and the powers, Those who do not become weary of saṃsāra, And those who practice supreme awakening Practice without laziness.

source: བསམ་གཏན་སྤྱོད་དང་ཏིང་འཛིན་སྤྱོད་པ་དང་། །ལུས་དང་སེམས་ནི་རབ་ཏུ་དབེན་སྤྱོད་དང་། །བྱང་ཆུབ་མཆོག་གི་སྤྱོད་པ་གང་སྤྱོད་པ། །དེ་དག་གཡེང་བ་མེད་པར་སྤྱོད་པ་ཡིན། །
en: “Those who practice concentration and absorption, Those who practice physical and mental disengagement, And those who practice supreme awakening Practice without distraction.

source: ཤེས་རབ་སྤྱོད་དང་བློ་མཆོག་སྤྱོད་པ་དང་། །ཆོས་རྣམས་ཐམས་ཅད་ཇི་བཞིན་སྤྱོད་པ་དང་། །བྱང་ཆུབ་མཆོག་གི་སྤྱོད་པ་གང་སྤྱོད་པ། །དེ་དག་ཤེས་རབ་འཆལ་པའི་སྤྱོད་པ་མེད། །
en: “Those who practice insight and intelligence, Those who realize all phenomena as they are, And those who practice supreme awakening Practice without mistaken insight.

source: བྱམས་པ་སྤྱོད་དང་ཕན་འདོད་སྤྱོད་པ་དང་། །སེམས་ཅན་ཀུན་ལ་སྙིང་རྗེ་སྤྱོད་པ་དང་། །བྱང་ཆུབ་མཆོག་གི་སྤྱོད་པ་གང་སྤྱོད་པ། །དེ་དག་ཁྲོ་བའི་ཐ་བ་མེད་པར་སྤྱོད། །
en: “Those who practice love and altruism, Those who practice compassion toward all sentient beings, And those who practice supreme awakening Practice without aggression.

source: སྟོང་པ་སྤྱོད་དང་རབ་ཏུ་དབེན་སྤྱོད་དང་། །མཚན་མ་མེད་པ་ཡོངས་སུ་དག་སྤྱོད་དང་། །བྱང་ཆུབ་མཆོག་གི་སྤྱོད་པ་གང་སྤྱོད་པ། །དེ་དག་སྨོན་པ་མེད་པར་སྤྱོད་པ་ཡིན། །
en: “Those who practice emptiness and disengagement, Those who practice the absence of marks and purity, And those who practice supreme awakening Practice without wishful thinking.

source: ཡང་དག་སྤྱོད་དང་དེ་བཞིན་ཉིད་སྤྱོད་དང་། །ཐམས་ཅད་མཁྱེན་པ་ཡོངས་སུ་དག་སྤྱོད་དང་། །བྱང་ཆུབ་མཆོག་གི་སྤྱོད་པ་གང་སྤྱོད་པ། །དེ་དག་གང་དུའང་ཆགས་པ་མེད་པར་སྤྱོད། །
en: “Those who practice authenticity and suchness, Those who practice the purity of omniscience, And those who practice supreme awakening Practice without attachment in all regards.

source: དད་པ་སྤྱོད་དང་དང་བ་སྤྱོད་པ་དང་། །དྲན་དང་གཡེང་བ་མེད་པར་སྤྱོད་པ་དང་། །བྱང་ཆུབ་མཆོག་གི་སྤྱོད་པ་གང་སྤྱོད་པ། །དེ་དག་ཡོངས་སུ་གཅོད་པ་མེད་པར་སྤྱོད། །
en: “Those who practice trust and faith, Those who practice mindfulness and nondistraction, And those who practice supreme awakening Practice without judgmental thoughts.

source: བསམ་གཏན་སྤྱོད་དང་རྣམ་ཐར་སྤྱོད་པ་དང་། །མངོན་ཤེས་ལྔ་རྣམས་ཡོངས་དག་སྤྱོད་པ་དང་། །བྱང་ཆུབ་མཆོག་གི་སྤྱོད་པ་གང་སྤྱོད་པ། །དེ་དག་ཆགས་པ་མེད་པར་སྤྱོད་པ་ཡིན། །
en: “Those who practice concentration and liberation, Those who practice the purity of the five higher perceptions, And those who practice supreme awakening Practice without attachment.

source: སངས་རྒྱས་སྤྱོད་དང་དམ་ཆོས་སྤྱོད་པ་དང་། །དགེ་འདུན་དཀོན་མཆོག་ཉེ་བར་བརྟན་སྤྱོད་དང་། །བྱང་ཆུབ་མཆོག་གི་སྤྱོད་པ་གང་སྤྱོད་པ། །དེ་དག་དཀོན་མཆོག་མཆོག་གི་སྤྱོད་པ་ཡིན། །
en: “Those who practice the Buddha and the sacred Dharma, Those who attend to the Saṅgha Jewel, And those who practice supreme awakening Practice the supreme Three Jewels.

source: ཆོས་སྤྱོད་པ་དང་ཤིན་ཏུ་རིགས་སྤྱོད་དང་། །སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་སྤྱོད་དང་། །བྱང་ཆུབ་མཆོག་གི་སྤྱོད་པ་གང་སྤྱོད་པ། །དེ་དག་རྒྱུན་མི་འཆད་པར་སྤྱོད་པ་ཡིན། །
en: “Those who practice the Dharma and what is suitable, Those who practice ripening all beings, And those who practice supreme awakening Practice without interruption.

source: བྱ་བ་སྤྱོད་དང་ཆོས་རྣམས་སྤྱོད་པ་དང་། །མཐའ་ཀུན་ཡོངས་སུ་གཅོད་པའི་སྤྱོད་པ་དང་། །བྱང་ཆུབ་མཆོག་གི་སྤྱོད་པ་གང་སྤྱོད་པ། །དེ་དག་གང་དུའང་ལྟ་བར་སྤྱོད་པ་མེད། །
en: “Those who practice proper deeds and qualities, Those who practice eliminating all views, And those who practice supreme awakening Practice free from all metaphysical views.

source: དག་པར་སྤྱོད་དང་རྣམ་པར་དག་སྤྱོད་དང་། །ཉོན་མོངས་ཐམས་ཅད་ཡོངས་སུ་གཅོད་སྤྱོད་དང་། །བྱང་ཆུབ་མཆོག་གི་སྤྱོད་པ་གང་སྤྱོད་པ། །དེ་དག་ཡོངས་སུ་གདུང་བར་སྤྱོད་པ་མེད། །
en: “Those who practice purity and stainlessness, Those who practice to eliminate all afflictions, And those who practice supreme awakening Practice without longing.

source: བདེ་བ་སྤྱོད་དང་ཤིན་ཏུ་རྣམ་ཐར་སྤྱོད། །སེམས་ཅན་ཀུན་ལ་འཇིགས་མེད་མཆོག་སྤྱོད་དང་། །བྱང་ཆུབ་མཆོག་གི་སྤྱོད་པ་གང་སྤྱོད་པ། །དེ་དག་སྨོན་ལམ་སྤྱོད་པ་མེད་པ་ཡིན། །
en: “Those who practice happiness and liberation, Those who give supreme fearlessness to all beings, And those who practice supreme awakening Practice without aspirations.

source: ཉི་མ་སྤྱོད་དང་ཟླ་བ་སྤྱོད་པ་དང་། །པད་མ་ལྟ་བུར་གོས་པ་མེད་སྤྱོད་དང་། །བྱང་ཆུབ་མཆོག་གི་སྤྱོད་པ་གང་སྤྱོད་པ། །དེ་དག་ལྷར་བཅས་འཇིག་རྟེན་ཕྱག་བྱ་བ། །
en: “Those who practice like the sun and the moon, Those who remain unsullied like a lotus, And those who practice supreme awakening Are revered by the world with its gods.

source: བརྒྱ་བྱིན་སྤྱོད་དང་ཚངས་པའི་སྤྱོད་པ་དང་། །དཀར་པོའི་ཆོས་རྣམས་ཡོངས་སུ་རྫོགས་སྤྱོད་དང་། །བྱང་ཆུབ་མཆོག་གི་སྤྱོད་པ་གང་སྤྱོད་པ། །དེ་དག་བདུད་རྣམས་སྡེར་བཅས་སྐྲག་པར་བྱེད། །
en: “Those who practice like Śakra and Brahmā, Those who perfect wholesome qualities, And those who practice supreme awakening Strike fear into Māra and his hordes.

source: མཆོག་སྤྱོད་པ་དང་ཁྱད་པར་འཕགས་སྤྱོད་དང་། །འདོད་ཆགས་ཉེས་པ་ཐ་བ་གཅོད་སྤྱོད་དང་། །བྱང་ཆུབ་མཆོག་གི་སྤྱོད་པ་གང་སྤྱོད་པ། །དེ་དག་གང་དུའང་གཏི་མུག་སྤྱོད་པ་མེད། །
en: “Those who practice what is supreme and exalted, Those who eliminate the affliction of desire, And those who practice supreme awakening Practice without ignorance in all regards.

source: ལམ་སྤྱོད་པ་དང་མུ་སྟེགས་སྤྱོད་པ་དང་། །ཤེས་རབ་མིག་ནི་ཡོངས་སུ་དག་སྤྱོད་དང་། །བྱང་ཆུབ་མཆོག་གི་སྤྱོད་པ་གང་སྤྱོད་པ། །དེ་དག་ཡོངས་སུ་རྟོག་པར་སྤྱོད་པ་མེད། །
en: “Those who practice the path and are fond of non-Buddhists, Those who practice the pure eye of insight, And those who practice supreme awakening Are not practicing while forming concepts.

source: དུལ་བ་སྤྱོད་དང་རབ་ཏུ་ཞི་སྤྱོད་དང་། །མིང་དང་གཟུགས་ལ་མི་ཆགས་སྤྱོད་པ་དང་། །བྱང་ཆུབ་མཆོག་གི་སྤྱོད་པ་གང་སྤྱོད་པ། །དེ་དག་ལྷ་དང་མི་ནི་མང་པོས་བསྟོད། །
en: “Those who practice self-control and pacification, Those who practice freedom from attachment to name-and-form, And those who practice supreme awakening Are praised by many gods and humans.

source: འཕགས་པའི་སྤྱོད་དང་ཤིན་ཏུ་མཉམ་སྤྱོད་དང་། །གཡོན་ཕྱོགས་ལམ་ནི་ཡོངས་སུ་གཅོད་སྤྱོད་དང་། །བྱང་ཆུབ་མཆོག་གི་སྤྱོད་པ་གང་སྤྱོད་པ། །དེ་དག་རྟག་ཏུ་དོན་ལ་འབབ་པ་ཡིན། །
en: “Those who practice sameness like noble beings, Those who practice bringing an end to the path of deception, And those who practice supreme awakening Always reach the true meaning.

source: དཔའ་བོ་སྤྱོད་དང་ཤིན་ཏུ་བརྟན་སྤྱོད་པ། །བདུད་ཀྱི་སྡེ་རྣམས་འཇིགས་པར་བྱེད་སྤྱོད་དང་། །བྱང་ཆུབ་མཆོག་གི་སྤྱོད་པ་གང་སྤྱོད་པ། །དེ་དག་བྱང་ཆུབ་སྙིང་པོར་གཞོལ་བ་ཡིན། །
en: “Those who practice like heroes and with complete stability, Those who practice scaring away Māra and his hordes, And those who practice supreme awakening Are heading for the seat of awakening.

source: གཟུང་བ་སྤྱོད་དང་དོན་ཡོད་སྤྱོད་པ་དང་། །གཟུངས་ལ་གཡེང་བ་མེད་པར་སྤྱོད་པ་དང་། །བྱང་ཆུབ་མཆོག་གི་སྤྱོད་པ་གང་སྤྱོད་པ། །དེ་དག་གང་དུའང་མ་རིག་སྤྱོད་པ་མེད། །
en: “Those who practice remembrance and what is meaningful, Those who practice retention without distraction, And those who practice supreme awakening Practice without ignorance in all regards.

source: དགོན་པ་སྤྱོད་དང་རབ་ཏུ་དབེན་སྤྱོད་པ། །རྟག་ཏུ་རབ་ཏུ་འབྱུང་བར་སྤྱོད་པ་དང་། །བྱང་ཆུབ་མཆོག་གི་སྤྱོད་པ་གང་སྤྱོད་པ། །དེ་དག་ནན་ཏན་བྱེད་པར་སྤྱོད་པ་ཡིན། །
en: “Those who practice seclusion and disengagement, Those who practice constant renunciation, And those who practice supreme awakening Practice with earnest determination.

source: གཙོ་བོའི་སྤྱོད་དང་ཁྱད་པར་འཕགས་སྤྱོད་དང་། །འཇིག་རྟེན་ཐམས་ཅད་ཟིལ་གནོན་སྤྱོད་པ་དང་། །བྱང་ཆུབ་མཆོག་གི་སྤྱོད་པ་གང་སྤྱོད་པ། །དེ་དག་ཆུང་ངུ་ལ་ནི་སྤྱོད་པ་མེད། །
en: “Those who practice what is primary and exalted, Those who practice outshining the entire world, And those who practice supreme awakening Are not practicing an inferior form of conduct.

source: རིགས་པ་སྤྱོད་དང་ཐབས་ལ་སྤྱོད་པ་དང་། །བསམ་གཏན་བདེ་ལས་ལྡོག་པར་སྤྱོད་པ་དང་། །བྱང་ཆུབ་མཆོག་གི་སྤྱོད་པ་གང་སྤྱོད་པ། །དེ་དག་མི་ཤེས་སྤྱོད་པ་མེད་པ་ཡིན། །
en: “Those who practice reasoning and method, Those who practice renouncing the bliss of concentration, And those who practice supreme awakening Practice without ignorance.

source: ལྟ་བ་སྤྱོད་དང་རྣམ་པར་ལྟ་སྤྱོད་དང་། །མིང་དང་གཟུགས་ལ་མི་ཆགས་སྤྱོད་པ་དང་། །བྱང་ཆུབ་མཆོག་གི་སྤྱོད་པ་གང་སྤྱོད་པ། །དེ་དག་འཇིགས་པ་མེད་པར་སྤྱོད་པ་ཡིན། །
en: “Those who practice the view and comprehensive view, Those who practice freedom from attachment to name-and-form, And those who practice supreme awakening Practice without fear.

source: ཐམས་ཅད་སྤྱོད་དང་ཀུན་ཏུ་སྤྱོད་པ་དང་། །དབང་པོ་ཡོངས་སུ་སྨིན་པར་སྤྱོད་པ་དང་། །བྱང་ཆུབ་མཆོག་གི་སྤྱོད་པ་གང་སྤྱོད་པ། །དེ་དག་ཡེ་ཤེས་ནམ་མཁའི་མཐའ་དང་འདྲ། །
en: “Those who engage in all and everything, Those who practice ripening beings’ faculties, And those who practice supreme awakening Will have wisdom that extends to the limits of space.”

source: བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་བསྟན་པའི་ཚིགས་སུ་བཅད་པ་མངོན་པར་བསྒྲུབ་པ་འདི་པི་བང་གི་སྒྲ་དེ་ལས་བྱུང་བ་ན།
en: eWhen those verses describing bodhisattva conduct manifested from the tunes of the lute,

source: བྱང་ཆུབ་སེམས་དཔའ་ལྔ་སྟོང་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་རབ་ཏུ་ཐོབ་པར་གྱུར་ཏོ། །
en: five thousand bodhisattvas reached acceptance of the unborn nature of phenomena.

source: རྒྱལ་པོ་མ་སྐྱེས་དགྲའི་འཁོར་དང་། རྒྱལ་པོའི་ཁབ་ཀྱི་བྲམ་ཟེ་དང་། ཁྱིམ་བདག་དང་། མི་འམ་ཅི་དང་། དྲི་ཟ་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དེ་དག་གི་འཁོར་གྱི་སྲོག་ཆགས་བརྒྱད་སྟོང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ནས་ཚིག་འདི་སྐད་ཅེས་བཅོམ་ལྡན་འདས་བདག་ཅག་ཀྱང་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་འདི་ལ་བསླབ་པར་བགྱིའོ། །
en: The retinue of King Ajātaśatru, the brahmins and householders from Rājagṛha, and eight thousand members of the retinues of the kiṃnaras, gandharvas, and mahoragas gave rise to the mind set on unsurpassed and perfect awakening. They promised, “Blessed One, we will also train in bodhisattva conduct!

source: ནན་ཏན་གྱིས་བསྒྲུབ་པར་བགྱིའོ། །
en: We will accomplish it earnestly, and

source: སེམས་ཅན་ཚད་མ་མཆིས་པ་དག་ཀྱང་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་འདི་ཉིད་ཡང་དག་པར་འཛིན་དུ་སྩལ་བར་བགྱིའོ་ཞེས་སྨྲས་སོ། །
en: we will encourage countless beings to adhere to this bodhisattva conduct!”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་མི་འམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོ་འགྲོར་གནང་ངོ་། །
en: After that, the Blessed One gave his approval for the kiṃnara king Druma to depart.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་གནང་བས་མི་འམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོ་བུ་དང་བཅས། དཔུང་དང་བཅས། སླས་དང་བཅས། རང་གི་སྐྱེ་བོ་དང་བཅས་འཁོར་དང་བཅས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས་བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ཏེ།
en: Having received the Blessed One’s consent, the kiṃnara king Druma as well as his sons, troops, queens, subjects, and attendants prostrated to the feet of the Blessed One and circumambulated him three times.

source: བཟོད་པ་གསོལ་ནས་སིལ་སྙན་དཀྲོལ། མེ་ཏོག་གི་ཆར་ཕབ། འོད་ཟེར་གྱི་དྲ་བ་ཕྱུང་སྟེ།
en: While bidding him farewell, they played music, caused a rain of flowers to fall, and emitted webs of light.

source: ས་ཆེན་པོ་རྣམ་པ་དྲུག་ཏུ་གཡོས་པར་བྱས་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཐད་ནས་སོང་སྟེ། དེ་སྐད་ཅིག་ཐང་ཅིག་ཡུད་ཙམ་དེ་ཉིད་ལ་རིའི་རྒྱལ་པོ་སྤོས་ཀྱི་ངད་ལྡང་དུ་རང་གི་ཁྱིམ་དུ་ཕྱིན་ཏོ། །
en: As the earth quaked in six different ways, they left the Blessed One and in that very instant arrived back home on the majestic Mount Gandhamādana.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Śakra, lord of the gods, then said to the Blessed One,

source: བཅོམ་ལྡན་འདས་མི་འམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོས་དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པ་དང་ཆོས་ལ་མཆོད་པས་བདག་ཟིལ་གྱིས་ནོན་ཏོ། །
en: “Blessed One, the kiṃnara king Druma surpasses me in terms of his worship of the Thus-Gone One and the Dharma!”
